# DeleteWallSym

## Description
Function DeleteWallSym deletes the referenced symbol from a wall object.

```pascal
FUNCTION DeleteWallSym(symbolHd : HANDLE) : BOOLEAN;
```

```python

def vs.DeleteWallSym(symbolHd):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|symbolHd|HANDLE|Handle to symbol.|

## Version
Availability: from MiniCAD6.0
## Category
* Objects - Walls